farid132097/Atmega328P_Optimized_Libraries/timebase.c
/* 
 * File:   timebase.c
 * Author: MD. Faridul Islam
 * Atmega328P Timebase Library
 * Created on October 30, 2022, 19:00
 */

#include <avr/io.h>
#include <util/delay.h>
#include <avr/interrupt.h>
#include "timebase.h"

#define  TIMEBASE_COUNT_ATOMIC_OPERATION
//#define  TIMEBASE_TOKEN_FUNCTIONS
//#define  TIMEBASE_TIME_WINDOW_CALCULATION





/********************************Structure & Enumeration Start******************************/

typedef union {
  struct {
    volatile uint8_t       WatchDogTimer  :1;
    volatile uint8_t       RealTimeCounter:1;
    volatile uint8_t       GeneralTimer   :1;
    volatile uint8_t       TimerIndex     :5;
  };
  volatile uint8_t         Value            ;
} timebase_timer_t;

typedef struct timebase_time_t{
  volatile uint8_t         OVFUpdateValue   ;
  volatile int32_t         LastSample       ;
  volatile uint16_t        SubSeconds       ;
  volatile int32_t         Seconds          ;
  volatile uint16_t        SubSecondsShadow ;
  volatile int32_t         SecondsShadow    ;
  volatile uint8_t         VariablesSync    ;
  
  #ifdef TIMEBASE_TIME_WINDOW_CALCULATION
  int32_t                  StartTimeSeconds   ;
  int32_t                  StartTimeSubSeconds;
  uint8_t                  Status             ;
  #endif
}timebase_time_t;

typedef union {
  struct {
    uint8_t               PeriodFlag     :1;
    uint8_t               Value          :4;
  };
  volatile uint8_t        StatusByte       ;
} timebase_status_t;


#ifdef TIMEBASE_UPCOUNTER_SUBSECONDS
typedef struct timebase_upcounter_ss_t{
  timebase_status_t       Status           ;
  int32_t                 EndValueSec      ;
  int32_t                 EndValueSubSec   ;
  int32_t                 Target           ;
  int32_t                 Temporary        ;
  int32_t                 Value            ;
  int32_t                 PeriodValue      ;
}timebase_upcounter_ss_t;
#endif


#ifdef TIMEBASE_UPCOUNTER
typedef struct timebase_upcounter_t{
  timebase_status_t       Status           ;
  int32_t                 EndValue         ;
  int32_t                 Target           ;
  int32_t                 Temporary        ;
  int32_t                 Value            ;
  int32_t                 PeriodValue      ;
}timebase_upcounter_t;
#endif



#ifdef TIMEBASE_DOWNCOUNTER_SUBSECONDS
typedef struct timebase_downcounter_ss_t{
  timebase_status_t       Status           ;
  int32_t                 EndValueSec      ;
  int32_t                 EndValueSubSec   ;
  int32_t                 Value            ;
  int32_t                 PeriodValue      ;
}timebase_downcounter_ss_t;
#endif


#ifdef TIMEBASE_DOWNCOUNTER
typedef struct timebase_downcounter_t{
  timebase_status_t         Status         ;
  int32_t                   EndValue       ;
  int32_t                   Value          ;
  int32_t                   PeriodValue    ;
}timebase_downcounter_t;
#endif

typedef struct timebase_config_t{
  timebase_timer_t        TimerType        ;
  volatile uint16_t       UpdateRate       ;
}timebase_config_t;

typedef struct timebase_t{
  timebase_config_t      Config                             ;
  timebase_time_t        Time                               ;
  volatile uint8_t       UpdateRequest                      ;
  
  #ifdef TIMEBASE_TOKEN_FUNCTIONS
  volatile uint8_t       ActiveTokens                       ;
  #endif
  
  #ifdef TIMEBASE_UPCOUNTER_SUBSECONDS
  timebase_upcounter_ss_t UpCounterSS[TIMEBASE_UPCOUNTER_SUBSECONDS] ;
  #endif
  
  #ifdef TIMEBASE_UPCOUNTER
  timebase_upcounter_t   UpCounter[TIMEBASE_UPCOUNTER]      ;
  #endif
  
  #ifdef TIMEBASE_DOWNCOUNTER_SUBSECONDS
  timebase_downcounter_ss_t DownCounterSS[TIMEBASE_DOWNCOUNTER_SUBSECONDS] ;
  #endif
  
  #ifdef TIMEBASE_DOWNCOUNTER
  timebase_downcounter_t DownCounter[TIMEBASE_DOWNCOUNTER]  ;
  #endif
  
}timebase_t;



enum{
  COUNTER_STATE_RESET       = 0,
  COUNTER_STATE_START       = 1,
  COUNTER_STATE_STARTED     = 1,
  COUNTER_STATE_STOP        = 2,
  COUNTER_STATE_STOPPED     = 2,
  COUNTER_STATE_EXPIRED     = 4
};

enum{
  FLAG_STATE_RESET          = 0,
  FLAG_STATE_SET            = 1,
};

enum{
  TIMEBASE_FALSE            = 0,
  TIMEBASE_TRUE             = 1,
};

enum{
  UPCOUNTER_UPDATE_REQ      = 1,
  DOWNCOUNTER_UPDATE_REQ    = 2,
  UPCOUNTER_SS_UPDATE_REQ   = 4,
  DOWNCOUNTER_SS_UPDATE_REQ = 8
};
  

  

timebase_t Timebase_type;
timebase_t *Timebase;

/********************************Structure & Enumeration End******************************/









/************************************Basic Functions Start*******************************/

void Timebase_Struct_Init(void){
  Timebase=&Timebase_type;
  Timebase->Config.TimerType.Value = 0;
  Timebase->Config.TimerType.GeneralTimer = 1;
  Timebase->Config.TimerType.TimerIndex = 0;
  Timebase->Config.UpdateRate = 1;
  Timebase->Time.OVFUpdateValue=0;
  Timebase->Time.SubSecondsShadow = 0;
  Timebase->Time.SecondsShadow = 0;
  Timebase->Time.SubSeconds = 0;
  Timebase->Time.Seconds = 0;
  Timebase->Time.VariablesSync = 0;
  Timebase->Time.LastSample = 0;
  
  #ifdef TIMEBASE_TIME_WINDOW_CALCULATION
    Timebase->Time.StartTimeSeconds = 0;
	Timebase->Time.StartTimeSubSeconds = 0;
	Timebase->Time.Status = 0;
  #endif
  
  Timebase->UpdateRequest = 0;
  
  #ifdef TIMEBASE_TOKEN_FUNCTIONS
  Timebase->ActiveTokens = 0;
  #endif

  #ifdef TIMEBASE_UPCOUNTER
  for(uint8_t i=0; i < TIMEBASE_UPCOUNTER; i++){
    Timebase->UpCounter[i].Status.StatusByte = 0;  
    Timebase->UpCounter[i].EndValue = 0;
    Timebase->UpCounter[i].Target = 0;
    Timebase->UpCounter[i].Temporary = 0;    
    Timebase->UpCounter[i].Value = 0;
    Timebase->UpCounter[i].PeriodValue = 0;
  }
  #endif
  
  #ifdef TIMEBASE_UPCOUNTER_SUBSECONDS
  for(uint8_t i=0; i < TIMEBASE_UPCOUNTER_SUBSECONDS; i++){
    Timebase->UpCounterSS[i].Status.StatusByte = 0;  
    Timebase->UpCounterSS[i].EndValueSec = 0;
	Timebase->UpCounterSS[i].EndValueSubSec = 0;
    Timebase->UpCounterSS[i].Target = 0;
    Timebase->UpCounterSS[i].Temporary = 0;    
    Timebase->UpCounterSS[i].Value = 0;
    Timebase->UpCounterSS[i].PeriodValue = 0;
  }
  #endif

