farid132097/Atmega328P_Optimized_Libraries/timebase.c
}

void Timebase_Init(uint16_t UpdateRateHz){
  Timebase_Struct_Init();
  Timebase_Timer_Config(UpdateRateHz);
  Timebase_Reset();
}

void Timebase_Main_Loop_Executables(void){
  
  #ifdef TIMEBASE_UPCOUNTER_SUBSECONDS
  if(Timebase->UpdateRequest & UPCOUNTER_SS_UPDATE_REQ){
    Timebase_Timer_Sync_With_Shadow_Variables();
    Timebase_UpCounter_SS_Update_All();
	Timebase->UpdateRequest &=~ UPCOUNTER_SS_UPDATE_REQ;
  }
  #endif

  #ifdef TIMEBASE_UPCOUNTER
  if(Timebase->UpdateRequest & UPCOUNTER_UPDATE_REQ){
    Timebase_Timer_Sync_With_Shadow_Variables();
    Timebase_UpCounter_Update_All();
	Timebase->UpdateRequest &=~ UPCOUNTER_UPDATE_REQ;
  }
  #endif
  
  
  
  #ifdef TIMEBASE_DOWNCOUNTER_SUBSECONDS
  if(Timebase->UpdateRequest & DOWNCOUNTER_SS_UPDATE_REQ){
    Timebase_Timer_Sync_With_Shadow_Variables();
    Timebase_DownCounter_SS_Update_All();
	Timebase->UpdateRequest &=~ DOWNCOUNTER_SS_UPDATE_REQ;
  }
  #endif
  
  #ifdef TIMEBASE_DOWNCOUNTER
  if(Timebase->UpdateRequest & DOWNCOUNTER_UPDATE_REQ){
    Timebase_Timer_Sync_With_Shadow_Variables();
    Timebase_DownCounter_Update_All();
	Timebase->UpdateRequest &=~ DOWNCOUNTER_UPDATE_REQ;
  }
  #endif
  Timebase->Time.VariablesSync = TIMEBASE_FALSE;
}

void Timebase_ISR_Executables(void){
  Timebase->Time.SubSecondsShadow++;
  
  #ifdef TIMEBASE_UPCOUNTER_SUBSECONDS
  Timebase->UpdateRequest |= UPCOUNTER_SS_UPDATE_REQ;
  #endif
  
  #ifdef TIMEBASE_DOWNCOUNTER_SUBSECONDS
  Timebase->UpdateRequest |= DOWNCOUNTER_SS_UPDATE_REQ;
  #endif
  
  if(Timebase->Time.SubSecondsShadow >= Timebase->Config.UpdateRate){
    Timebase->Time.SecondsShadow++;
    Timebase->Time.SubSecondsShadow = 0;
	
	#ifdef TIMEBASE_UPCOUNTER
    Timebase->UpdateRequest |= UPCOUNTER_UPDATE_REQ;
    #endif
	
	#ifdef TIMEBASE_DOWNCOUNTER
    Timebase->UpdateRequest |= DOWNCOUNTER_UPDATE_REQ;
    #endif
  }
}

/********************************Common Functions End*******************************/









/*************************************ISR Start************************************/

ISR(TIMER0_OVF_vect){
  TCNT0  = Timebase->Time.OVFUpdateValue;
  Timebase_ISR_Executables();
}

/**************************************ISR End*************************************/






